zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_A2HOUR Bits */
/* LFSS_A2HOUR[AHOURBIN] Bits */
#define LFSS_A2HOUR_AHOURBIN_OFS                 (0)                             /* !< AHOURBIN Offset */
#define LFSS_A2HOUR_AHOURBIN_MASK                ((uint32_t)0x0000001FU)         /* !< Alarm Hours Binary (0 to 23). If
                                                                                    RTCBCD=1 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define LFSS_A2HOUR_AHOURBIN_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A2HOUR_AHOURBIN_MAXIMUM             ((uint32_t)0x00000017U)         /* !< Highest possible value */
/* LFSS_A2HOUR[AHOURAEBIN] Bits */
#define LFSS_A2HOUR_AHOURAEBIN_OFS               (7)                             /* !< AHOURAEBIN Offset */
#define LFSS_A2HOUR_AHOURAEBIN_MASK              ((uint32_t)0x00000080U)         /* !< Alarm Hours Binary enable. If
                                                                                    RTCBCD=1 this bit is always 0. Write
                                                                                    to this bit will be ignored.   0x0=
                                                                                    Alarm disabled.   0x1= Alarm enabled. */
#define LFSS_A2HOUR_AHOURAEBIN_DISABLE           ((uint32_t)0x00000000U)         /* !< No alarm */
#define LFSS_A2HOUR_AHOURAEBIN_ENABLE            ((uint32_t)0x00000080U)         /* !< Alarm enabled */
/* LFSS_A2HOUR[AHOURLOWBCD] Bits */
#define LFSS_A2HOUR_AHOURLOWBCD_OFS              (8)                             /* !< AHOURLOWBCD Offset */
#define LFSS_A2HOUR_AHOURLOWBCD_MASK             ((uint32_t)0x00000F00U)         /* !< Alarm Hours BCD  low digit (0 to
                                                                                    9). If RTCBCD=0 write to these bits
                                                                                    will be ignored and read give the
                                                                                    value 0. */
#define LFSS_A2HOUR_AHOURLOWBCD_MINIMUM          ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A2HOUR_AHOURLOWBCD_MAXIMUM          ((uint32_t)0x00000900U)         /* !< Highest possible value */
/* LFSS_A2HOUR[AHOURHIGHBCD] Bits */
#define LFSS_A2HOUR_AHOURHIGHBCD_OFS             (12)                            /* !< AHOURHIGHBCD Offset */
#define LFSS_A2HOUR_AHOURHIGHBCD_MASK            ((uint32_t)0x00003000U)         /* !< Alarm Hours BCD  high digit (0 to
                                                                                    2). If RTCBCD=0 write to these bits
                                                                                    will be ignored and read give the
                                                                                    value 0.. */
#define LFSS_A2HOUR_AHOURHIGHBCD_MINIMUM         ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A2HOUR_AHOURHIGHBCD_MAXIMUM         ((uint32_t)0x00002000U)         /* !< Highest possible value */
/* LFSS_A2HOUR[AHOURAEBCD] Bits */
#define LFSS_A2HOUR_AHOURAEBCD_OFS               (15)                            /* !< AHOURAEBCD Offset */
#define LFSS_A2HOUR_AHOURAEBCD_MASK              ((uint32_t)0x00008000U)         /* !< Alarm Hours BCD enable. If RTCBCD=0
                                                                                    this bit is always 0. Write to this
                                                                                    bit will be ignored.   0x0= Alarm
                                                                                    disabled.   0x1= Alarm enabled. */
#define LFSS_A2HOUR_AHOURAEBCD_DISABLE           ((uint32_t)0x00000000U)         /* !< No alarm */
#define LFSS_A2HOUR_AHOURAEBCD_ENABLE            ((uint32_t)0x00008000U)         /* !< Alarm enabled */

/* LFSS_A2DAY Bits */
/* LFSS_A2DAY[ADOW] Bits */
#define LFSS_A2DAY_ADOW_OFS                      (0)                             /* !< ADOW Offset */
#define LFSS_A2DAY_ADOW_MASK                     ((uint32_t)0x00000007U)         /* !< Alarm Day of week (0 to 6). These
                                                                                    bits are valid if RTCBCD=1 or
                                                                                    RTCBCD=0. */
#define LFSS_A2DAY_ADOW_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A2DAY_ADOW_MAXIMUM                  ((uint32_t)0x00000006U)         /* !< Highest possible value */
/* LFSS_A2DAY[ADOWAE] Bits */
#define LFSS_A2DAY_ADOWAE_OFS                    (7)                             /* !< ADOWAE Offset */
#define LFSS_A2DAY_ADOWAE_MASK                   ((uint32_t)0x00000080U)         /* !< Alarm Day of week enable. This bit
                                                                                    are valid if RTCBCD=1 or RTCBCD=0. */
#define LFSS_A2DAY_ADOWAE_DISABLE                ((uint32_t)0x00000000U)         /* !< No alarm */
#define LFSS_A2DAY_ADOWAE_ENABLE                 ((uint32_t)0x00000080U)         /* !< Alarm enabled */
/* LFSS_A2DAY[ADOMBIN] Bits */
#define LFSS_A2DAY_ADOMBIN_OFS                   (8)                             /* !< ADOMBIN Offset */
#define LFSS_A2DAY_ADOMBIN_MASK                  ((uint32_t)0x00001F00U)         /* !< Alarm Day of month Binary (1 to 28,
                                                                                    29, 30, 31) If RTCBCD=1 write to
                                                                                    these bits will be ignored and read
                                                                                    give the value 0. */
#define LFSS_A2DAY_ADOMBIN_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A2DAY_ADOMBIN_MAXIMUM               ((uint32_t)0x00001F00U)         /* !< Highest possible value */
/* LFSS_A2DAY[ADOMAEBIN] Bits */
#define LFSS_A2DAY_ADOMAEBIN_OFS                 (15)                            /* !< ADOMAEBIN Offset */
#define LFSS_A2DAY_ADOMAEBIN_MASK                ((uint32_t)0x00008000U)         /* !< Alarm Day of month Binary enable.
                                                                                    If RTCBCD=1 this bit is always 0.
                                                                                    Write to this bit will be ignored.
                                                                                    0x0= Alarm disabled.   0x1= Alarm
                                                                                    enabled. */
#define LFSS_A2DAY_ADOMAEBIN_DISABLE             ((uint32_t)0x00000000U)         /* !< No alarm */
#define LFSS_A2DAY_ADOMAEBIN_ENABLE              ((uint32_t)0x00008000U)         /* !< Alarm enabled */
/* LFSS_A2DAY[ADOMLOWBCD] Bits */
#define LFSS_A2DAY_ADOMLOWBCD_OFS                (16)                            /* !< ADOMLOWBCD Offset */
#define LFSS_A2DAY_ADOMLOWBCD_MASK               ((uint32_t)0x000F0000U)         /* !< Alarm Day of month BCD  low digit
                                                                                    (0 to 9). If RTCBCD=0 write to these
                                                                                    bits will be ignored and read give
                                                                                    the value 0. */
#define LFSS_A2DAY_ADOMLOWBCD_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A2DAY_ADOMLOWBCD_MAXIMUM            ((uint32_t)0x00090000U)         /* !< Highest possible value */
/* LFSS_A2DAY[ADOMHIGHBCD] Bits */
#define LFSS_A2DAY_ADOMHIGHBCD_OFS               (20)                            /* !< ADOMHIGHBCD Offset */
#define LFSS_A2DAY_ADOMHIGHBCD_MASK              ((uint32_t)0x00300000U)         /* !< Alarm Day of month BCD  high digit
                                                                                    (0 to 3). If RTCBCD=0 write to these
                                                                                    bits will be ignored and read give
                                                                                    the value 0. */
#define LFSS_A2DAY_ADOMHIGHBCD_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A2DAY_ADOMHIGHBCD_MAXIMUM           ((uint32_t)0x00300000U)         /* !< Highest possible value */
/* LFSS_A2DAY[ADOMAEBCD] Bits */
#define LFSS_A2DAY_ADOMAEBCD_OFS                 (23)                            /* !< ADOMAEBCD Offset */
#define LFSS_A2DAY_ADOMAEBCD_MASK                ((uint32_t)0x00800000U)         /* !< Alarm Day of month BCD enable. If
                                                                                    RTCBCD=0 this bit is always 0. Write
                                                                                    to this bit will be ignored.   0x0=
                                                                                    Alarm disabled.   0x1= Alarm enabled. */
#define LFSS_A2DAY_ADOMAEBCD_DISABLE             ((uint32_t)0x00000000U)         /* !< No alarm */
#define LFSS_A2DAY_ADOMAEBCD_ENABLE              ((uint32_t)0x00800000U)         /* !< Alarm enabled */

/* LFSS_PSCTL Bits */
/* LFSS_PSCTL[RT0IP] Bits */
#define LFSS_PSCTL_RT0IP_OFS                     (2)                             /* !< RT0IP Offset */
#define LFSS_PSCTL_RT0IP_MASK                    ((uint32_t)0x0000001CU)         /* !< Prescale timer 0 interrupt interval */
#define LFSS_PSCTL_RT0IP_INT244US                ((uint32_t)0x00000008U)         /* !< Interval every 244 microsecond */
#define LFSS_PSCTL_RT0IP_INT488US                ((uint32_t)0x0000000CU)         /* !< Interval every 488 microsecond */
#define LFSS_PSCTL_RT0IP_INT0P98MS               ((uint32_t)0x00000010U)         /* !< Interval every 0.98 milisecond */
#define LFSS_PSCTL_RT0IP_INT1P95MS               ((uint32_t)0x00000014U)         /* !< Interval every 1.95 milisecond */
#define LFSS_PSCTL_RT0IP_INT3P91MS               ((uint32_t)0x00000018U)         /* !< Interval every 3.91 milisecond */
#define LFSS_PSCTL_RT0IP_INT7P81MS               ((uint32_t)0x0000001CU)         /* !< Interval every 7.81 milisecond */
/* LFSS_PSCTL[RT1IP] Bits */
#define LFSS_PSCTL_RT1IP_OFS                     (18)                            /* !< RT1IP Offset */
#define LFSS_PSCTL_RT1IP_MASK                    ((uint32_t)0x001C0000U)         /* !< Prescale timer 1 interrupt interval */
#define LFSS_PSCTL_RT1IP_INT15P6MS               ((uint32_t)0x00000000U)         /* !< Interval every 15.6 milisecond */
#define LFSS_PSCTL_RT1IP_INT31P3MS               ((uint32_t)0x00040000U)         /* !< Interval every 31.3 milisecond */
#define LFSS_PSCTL_RT1IP_INT62P5MS               ((uint32_t)0x00080000U)         /* !< Interval every 62.5 milisecond */
#define LFSS_PSCTL_RT1IP_INT125MS                ((uint32_t)0x000C0000U)         /* !< Interval every 125 milisecond */
#define LFSS_PSCTL_RT1IP_INT250MS                ((uint32_t)0x00100000U)         /* !< Interval every 250 milisecond */
#define LFSS_PSCTL_RT1IP_INT500MS                ((uint32_t)0x00140000U)         /* !< Interval every 500 milisecond */
#define LFSS_PSCTL_RT1IP_INT1S                   ((uint32_t)0x00180000U)         /* !< Interval every 1 second */
#define LFSS_PSCTL_RT1IP_INT2S                   ((uint32_t)0x001C0000U)         /* !< Interval every 2 second */

