zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_lfss.h
/* ---- 通用事件中断屏蔽寄存器 (GEN_EVENT_IMASK) ---- */
/* LFSS_GEN_EVENT_IMASK[RTCRDY] - RTC 就绪中断屏蔽 */
#define LFSS_GEN_EVENT_IMASK_RTCRDY_OFS          (0)                             /* !< RTCRDY Offset */
#define LFSS_GEN_EVENT_IMASK_RTCRDY_MASK         ((uint32_t)0x00000001U)         /* !< RTC ready */
#define LFSS_GEN_EVENT_IMASK_RTCRDY_CLR          ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_RTCRDY_SET          ((uint32_t)0x00000001U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[RTCTEV] Bits */
#define LFSS_GEN_EVENT_IMASK_RTCTEV_OFS          (1)                             /* !< RTCTEV Offset */
#define LFSS_GEN_EVENT_IMASK_RTCTEV_MASK         ((uint32_t)0x00000002U)         /* !< RTC time event */
#define LFSS_GEN_EVENT_IMASK_RTCTEV_CLR          ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_RTCTEV_SET          ((uint32_t)0x00000002U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[RTCA1] Bits */
#define LFSS_GEN_EVENT_IMASK_RTCA1_OFS           (2)                             /* !< RTCA1 Offset */
#define LFSS_GEN_EVENT_IMASK_RTCA1_MASK          ((uint32_t)0x00000004U)         /* !< RTC alarm 1 */
#define LFSS_GEN_EVENT_IMASK_RTCA1_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_RTCA1_SET           ((uint32_t)0x00000004U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[RTCA2] Bits */
#define LFSS_GEN_EVENT_IMASK_RTCA2_OFS           (3)                             /* !< RTCA2 Offset */
#define LFSS_GEN_EVENT_IMASK_RTCA2_MASK          ((uint32_t)0x00000008U)         /* !< RTC alarm 2 */
#define LFSS_GEN_EVENT_IMASK_RTCA2_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_RTCA2_SET           ((uint32_t)0x00000008U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[RT0PS] Bits */
#define LFSS_GEN_EVENT_IMASK_RT0PS_OFS           (4)                             /* !< RT0PS Offset */
#define LFSS_GEN_EVENT_IMASK_RT0PS_MASK          ((uint32_t)0x00000010U)         /* !< RTC prescale timer 0 */
#define LFSS_GEN_EVENT_IMASK_RT0PS_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_RT0PS_SET           ((uint32_t)0x00000010U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[RT1PS] Bits */
#define LFSS_GEN_EVENT_IMASK_RT1PS_OFS           (5)                             /* !< RT1PS Offset */
#define LFSS_GEN_EVENT_IMASK_RT1PS_MASK          ((uint32_t)0x00000020U)         /* !< RTC prescale timer 1 */
#define LFSS_GEN_EVENT_IMASK_RT1PS_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_RT1PS_SET           ((uint32_t)0x00000020U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[RT2PS] Bits */
#define LFSS_GEN_EVENT_IMASK_RT2PS_OFS           (6)                             /* !< RT2PS Offset */
#define LFSS_GEN_EVENT_IMASK_RT2PS_MASK          ((uint32_t)0x00000040U)         /* !< RTC prescale timer 2 */
#define LFSS_GEN_EVENT_IMASK_RT2PS_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_RT2PS_SET           ((uint32_t)0x00000040U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[TSEVT] Bits */
#define LFSS_GEN_EVENT_IMASK_TSEVT_OFS           (7)                             /* !< TSEVT Offset */
#define LFSS_GEN_EVENT_IMASK_TSEVT_MASK          ((uint32_t)0x00000080U)         /* !< Time stamp event */
#define LFSS_GEN_EVENT_IMASK_TSEVT_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_TSEVT_SET           ((uint32_t)0x00000080U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[TIO0] Bits */
#define LFSS_GEN_EVENT_IMASK_TIO0_OFS            (8)                             /* !< TIO0 Offset */
#define LFSS_GEN_EVENT_IMASK_TIO0_MASK           ((uint32_t)0x00000100U)         /* !< Tamper I/O 0 event */
#define LFSS_GEN_EVENT_IMASK_TIO0_CLR            ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_TIO0_SET            ((uint32_t)0x00000100U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[TIO1] Bits */
#define LFSS_GEN_EVENT_IMASK_TIO1_OFS            (9)                             /* !< TIO1 Offset */
#define LFSS_GEN_EVENT_IMASK_TIO1_MASK           ((uint32_t)0x00000200U)         /* !< Tamper I/O 1 event */
#define LFSS_GEN_EVENT_IMASK_TIO1_CLR            ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_TIO1_SET            ((uint32_t)0x00000200U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[TIO2] Bits */
#define LFSS_GEN_EVENT_IMASK_TIO2_OFS            (10)                            /* !< TIO2 Offset */
#define LFSS_GEN_EVENT_IMASK_TIO2_MASK           ((uint32_t)0x00000400U)         /* !< Tamper I/O 2 event */
#define LFSS_GEN_EVENT_IMASK_TIO2_CLR            ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_TIO2_SET            ((uint32_t)0x00000400U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[TIO3] Bits */
#define LFSS_GEN_EVENT_IMASK_TIO3_OFS            (11)                            /* !< TIO3 Offset */
#define LFSS_GEN_EVENT_IMASK_TIO3_MASK           ((uint32_t)0x00000800U)         /* !< Tamper I/O 3 event */
#define LFSS_GEN_EVENT_IMASK_TIO3_CLR            ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_TIO3_SET            ((uint32_t)0x00000800U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[TIO4] Bits */
#define LFSS_GEN_EVENT_IMASK_TIO4_OFS            (12)                            /* !< TIO4 Offset */
#define LFSS_GEN_EVENT_IMASK_TIO4_MASK           ((uint32_t)0x00001000U)         /* !< Tamper I/O 4 event */
#define LFSS_GEN_EVENT_IMASK_TIO4_CLR            ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_TIO4_SET            ((uint32_t)0x00001000U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[TIO5] Bits */
#define LFSS_GEN_EVENT_IMASK_TIO5_OFS            (13)                            /* !< TIO5 Offset */
#define LFSS_GEN_EVENT_IMASK_TIO5_MASK           ((uint32_t)0x00002000U)         /* !< Tamper I/O 5 event */
#define LFSS_GEN_EVENT_IMASK_TIO5_CLR            ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_TIO5_SET            ((uint32_t)0x00002000U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[TIO6] Bits */
#define LFSS_GEN_EVENT_IMASK_TIO6_OFS            (14)                            /* !< TIO6 Offset */
#define LFSS_GEN_EVENT_IMASK_TIO6_MASK           ((uint32_t)0x00004000U)         /* !< Tamper I/O 6 event */
#define LFSS_GEN_EVENT_IMASK_TIO6_CLR            ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_TIO6_SET            ((uint32_t)0x00004000U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[TIO7] Bits */
#define LFSS_GEN_EVENT_IMASK_TIO7_OFS            (15)                            /* !< TIO7 Offset */
#define LFSS_GEN_EVENT_IMASK_TIO7_MASK           ((uint32_t)0x00008000U)         /* !< Tamper I/O 7 event */
#define LFSS_GEN_EVENT_IMASK_TIO7_CLR            ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_TIO7_SET            ((uint32_t)0x00008000U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[TIO8] Bits */
#define LFSS_GEN_EVENT_IMASK_TIO8_OFS            (16)                            /* !< TIO8 Offset */
#define LFSS_GEN_EVENT_IMASK_TIO8_MASK           ((uint32_t)0x00010000U)         /* !< Tamper I/O 8 event */
#define LFSS_GEN_EVENT_IMASK_TIO8_CLR            ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_TIO8_SET            ((uint32_t)0x00010000U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[TIO9] Bits */
#define LFSS_GEN_EVENT_IMASK_TIO9_OFS            (17)                            /* !< TIO9 Offset */
#define LFSS_GEN_EVENT_IMASK_TIO9_MASK           ((uint32_t)0x00020000U)         /* !< Tamper I/O 9 event */
#define LFSS_GEN_EVENT_IMASK_TIO9_CLR            ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_TIO9_SET            ((uint32_t)0x00020000U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[TIO10] Bits */
#define LFSS_GEN_EVENT_IMASK_TIO10_OFS           (18)                            /* !< TIO10 Offset */
#define LFSS_GEN_EVENT_IMASK_TIO10_MASK          ((uint32_t)0x00040000U)         /* !< Tamper I/O 10 event */
#define LFSS_GEN_EVENT_IMASK_TIO10_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_TIO10_SET           ((uint32_t)0x00040000U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[TIO11] Bits */
#define LFSS_GEN_EVENT_IMASK_TIO11_OFS           (19)                            /* !< TIO11 Offset */
#define LFSS_GEN_EVENT_IMASK_TIO11_MASK          ((uint32_t)0x00080000U)         /* !< Tamper I/O 11 event */
#define LFSS_GEN_EVENT_IMASK_TIO11_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_TIO11_SET           ((uint32_t)0x00080000U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[TIO12] Bits */
#define LFSS_GEN_EVENT_IMASK_TIO12_OFS           (20)                            /* !< TIO12 Offset */
#define LFSS_GEN_EVENT_IMASK_TIO12_MASK          ((uint32_t)0x00100000U)         /* !< Tamper I/O 12 event */
#define LFSS_GEN_EVENT_IMASK_TIO12_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_TIO12_SET           ((uint32_t)0x00100000U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[TIO13] Bits */
#define LFSS_GEN_EVENT_IMASK_TIO13_OFS           (21)                            /* !< TIO13 Offset */
#define LFSS_GEN_EVENT_IMASK_TIO13_MASK          ((uint32_t)0x00200000U)         /* !< Tamper I/O 13 event */
#define LFSS_GEN_EVENT_IMASK_TIO13_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_TIO13_SET           ((uint32_t)0x00200000U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[TIO14] Bits */
#define LFSS_GEN_EVENT_IMASK_TIO14_OFS           (22)                            /* !< TIO14 Offset */
#define LFSS_GEN_EVENT_IMASK_TIO14_MASK          ((uint32_t)0x00400000U)         /* !< Tamper I/O 14 event */
#define LFSS_GEN_EVENT_IMASK_TIO14_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_TIO14_SET           ((uint32_t)0x00400000U)         /* !< Set Interrrupt Mask */
/* LFSS_GEN_EVENT_IMASK[TIO15] Bits */
#define LFSS_GEN_EVENT_IMASK_TIO15_OFS           (23)                            /* !< TIO15 Offset */
#define LFSS_GEN_EVENT_IMASK_TIO15_MASK          ((uint32_t)0x00800000U)         /* !< Tamper I/O 15 event */
#define LFSS_GEN_EVENT_IMASK_TIO15_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LFSS_GEN_EVENT_IMASK_TIO15_SET           ((uint32_t)0x00800000U)         /* !< Set Interrrupt Mask */

/* ---- 通用事件原始中断状态寄存器 (GEN_EVENT_RIS) ---- */
/* LFSS_GEN_EVENT_RIS[RTCRDY] - RTC 就绪原始中断状态 */
#define LFSS_GEN_EVENT_RIS_RTCRDY_OFS            (0)                             /* !< RTCRDY Offset */
#define LFSS_GEN_EVENT_RIS_RTCRDY_MASK           ((uint32_t)0x00000001U)         /* !< RTC ready */
#define LFSS_GEN_EVENT_RIS_RTCRDY_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_RTCRDY_SET            ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[RTCTEV] Bits */
#define LFSS_GEN_EVENT_RIS_RTCTEV_OFS            (1)                             /* !< RTCTEV Offset */
#define LFSS_GEN_EVENT_RIS_RTCTEV_MASK           ((uint32_t)0x00000002U)         /* !< RTC time event */
#define LFSS_GEN_EVENT_RIS_RTCTEV_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_RTCTEV_SET            ((uint32_t)0x00000002U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[RTCA1] Bits */
#define LFSS_GEN_EVENT_RIS_RTCA1_OFS             (2)                             /* !< RTCA1 Offset */
#define LFSS_GEN_EVENT_RIS_RTCA1_MASK            ((uint32_t)0x00000004U)         /* !< RTC alarm 1 */
#define LFSS_GEN_EVENT_RIS_RTCA1_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_RTCA1_SET             ((uint32_t)0x00000004U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[RTCA2] Bits */
#define LFSS_GEN_EVENT_RIS_RTCA2_OFS             (3)                             /* !< RTCA2 Offset */
#define LFSS_GEN_EVENT_RIS_RTCA2_MASK            ((uint32_t)0x00000008U)         /* !< RTC alarm 2 */
#define LFSS_GEN_EVENT_RIS_RTCA2_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_RTCA2_SET             ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[RT0PS] Bits */
#define LFSS_GEN_EVENT_RIS_RT0PS_OFS             (4)                             /* !< RT0PS Offset */
#define LFSS_GEN_EVENT_RIS_RT0PS_MASK            ((uint32_t)0x00000010U)         /* !< RTC prescale timer 0 */
#define LFSS_GEN_EVENT_RIS_RT0PS_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_RT0PS_SET             ((uint32_t)0x00000010U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[RT1PS] Bits */
#define LFSS_GEN_EVENT_RIS_RT1PS_OFS             (5)                             /* !< RT1PS Offset */
#define LFSS_GEN_EVENT_RIS_RT1PS_MASK            ((uint32_t)0x00000020U)         /* !< RTC prescale timer 1 */
#define LFSS_GEN_EVENT_RIS_RT1PS_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_RT1PS_SET             ((uint32_t)0x00000020U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[RT2PS] Bits */
#define LFSS_GEN_EVENT_RIS_RT2PS_OFS             (6)                             /* !< RT2PS Offset */
#define LFSS_GEN_EVENT_RIS_RT2PS_MASK            ((uint32_t)0x00000040U)         /* !< RTC prescale timer 2 */
#define LFSS_GEN_EVENT_RIS_RT2PS_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_RT2PS_SET             ((uint32_t)0x00000040U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[TSEVT] Bits */
#define LFSS_GEN_EVENT_RIS_TSEVT_OFS             (7)                             /* !< TSEVT Offset */
#define LFSS_GEN_EVENT_RIS_TSEVT_MASK            ((uint32_t)0x00000080U)         /* !< Time stamp event */
#define LFSS_GEN_EVENT_RIS_TSEVT_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_TSEVT_SET             ((uint32_t)0x00000080U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[TIO0] Bits */
#define LFSS_GEN_EVENT_RIS_TIO0_OFS              (8)                             /* !< TIO0 Offset */
#define LFSS_GEN_EVENT_RIS_TIO0_MASK             ((uint32_t)0x00000100U)         /* !< Tamper I/O 0 event */
#define LFSS_GEN_EVENT_RIS_TIO0_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_TIO0_SET              ((uint32_t)0x00000100U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[TIO1] Bits */
#define LFSS_GEN_EVENT_RIS_TIO1_OFS              (9)                             /* !< TIO1 Offset */
#define LFSS_GEN_EVENT_RIS_TIO1_MASK             ((uint32_t)0x00000200U)         /* !< Tamper I/O 1 event */
#define LFSS_GEN_EVENT_RIS_TIO1_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_TIO1_SET              ((uint32_t)0x00000200U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[TIO2] Bits */
#define LFSS_GEN_EVENT_RIS_TIO2_OFS              (10)                            /* !< TIO2 Offset */
#define LFSS_GEN_EVENT_RIS_TIO2_MASK             ((uint32_t)0x00000400U)         /* !< Tamper I/O 2 event */
#define LFSS_GEN_EVENT_RIS_TIO2_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_TIO2_SET              ((uint32_t)0x00000400U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[TIO3] Bits */
#define LFSS_GEN_EVENT_RIS_TIO3_OFS              (11)                            /* !< TIO3 Offset */
#define LFSS_GEN_EVENT_RIS_TIO3_MASK             ((uint32_t)0x00000800U)         /* !< Tamper I/O 3 event */
#define LFSS_GEN_EVENT_RIS_TIO3_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_TIO3_SET              ((uint32_t)0x00000800U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[TIO4] Bits */
#define LFSS_GEN_EVENT_RIS_TIO4_OFS              (12)                            /* !< TIO4 Offset */
#define LFSS_GEN_EVENT_RIS_TIO4_MASK             ((uint32_t)0x00001000U)         /* !< Tamper I/O 4 event */
#define LFSS_GEN_EVENT_RIS_TIO4_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_TIO4_SET              ((uint32_t)0x00001000U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[TIO5] Bits */
#define LFSS_GEN_EVENT_RIS_TIO5_OFS              (13)                            /* !< TIO5 Offset */
#define LFSS_GEN_EVENT_RIS_TIO5_MASK             ((uint32_t)0x00002000U)         /* !< Tamper I/O 5 event */
#define LFSS_GEN_EVENT_RIS_TIO5_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_TIO5_SET              ((uint32_t)0x00002000U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[TIO6] Bits */
#define LFSS_GEN_EVENT_RIS_TIO6_OFS              (14)                            /* !< TIO6 Offset */
#define LFSS_GEN_EVENT_RIS_TIO6_MASK             ((uint32_t)0x00004000U)         /* !< Tamper I/O 6 event */
#define LFSS_GEN_EVENT_RIS_TIO6_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_TIO6_SET              ((uint32_t)0x00004000U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[TIO7] Bits */
#define LFSS_GEN_EVENT_RIS_TIO7_OFS              (15)                            /* !< TIO7 Offset */
#define LFSS_GEN_EVENT_RIS_TIO7_MASK             ((uint32_t)0x00008000U)         /* !< Tamper I/O 7 event */
#define LFSS_GEN_EVENT_RIS_TIO7_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_TIO7_SET              ((uint32_t)0x00008000U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[TIO8] Bits */
#define LFSS_GEN_EVENT_RIS_TIO8_OFS              (16)                            /* !< TIO8 Offset */
#define LFSS_GEN_EVENT_RIS_TIO8_MASK             ((uint32_t)0x00010000U)         /* !< Tamper I/O 8 event */
#define LFSS_GEN_EVENT_RIS_TIO8_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_TIO8_SET              ((uint32_t)0x00010000U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[TIO9] Bits */
#define LFSS_GEN_EVENT_RIS_TIO9_OFS              (17)                            /* !< TIO9 Offset */
#define LFSS_GEN_EVENT_RIS_TIO9_MASK             ((uint32_t)0x00020000U)         /* !< Tamper I/O 9 event */
#define LFSS_GEN_EVENT_RIS_TIO9_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_TIO9_SET              ((uint32_t)0x00020000U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[TIO10] Bits */
#define LFSS_GEN_EVENT_RIS_TIO10_OFS             (18)                            /* !< TIO10 Offset */
#define LFSS_GEN_EVENT_RIS_TIO10_MASK            ((uint32_t)0x00040000U)         /* !< Tamper I/O 10 event */
#define LFSS_GEN_EVENT_RIS_TIO10_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_TIO10_SET             ((uint32_t)0x00040000U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[TIO11] Bits */
#define LFSS_GEN_EVENT_RIS_TIO11_OFS             (19)                            /* !< TIO11 Offset */
#define LFSS_GEN_EVENT_RIS_TIO11_MASK            ((uint32_t)0x00080000U)         /* !< Tamper I/O 11 event */
#define LFSS_GEN_EVENT_RIS_TIO11_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_TIO11_SET             ((uint32_t)0x00080000U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[TIO12] Bits */
#define LFSS_GEN_EVENT_RIS_TIO12_OFS             (20)                            /* !< TIO12 Offset */
#define LFSS_GEN_EVENT_RIS_TIO12_MASK            ((uint32_t)0x00100000U)         /* !< Tamper I/O 12 event */
#define LFSS_GEN_EVENT_RIS_TIO12_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_TIO12_SET             ((uint32_t)0x00100000U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[TIO13] Bits */
#define LFSS_GEN_EVENT_RIS_TIO13_OFS             (21)                            /* !< TIO13 Offset */
#define LFSS_GEN_EVENT_RIS_TIO13_MASK            ((uint32_t)0x00200000U)         /* !< Tamper I/O 13 event */
#define LFSS_GEN_EVENT_RIS_TIO13_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_TIO13_SET             ((uint32_t)0x00200000U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[TIO14] Bits */
#define LFSS_GEN_EVENT_RIS_TIO14_OFS             (22)                            /* !< TIO14 Offset */
#define LFSS_GEN_EVENT_RIS_TIO14_MASK            ((uint32_t)0x00400000U)         /* !< Tamper I/O 14 event */
#define LFSS_GEN_EVENT_RIS_TIO14_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_TIO14_SET             ((uint32_t)0x00400000U)         /* !< Interrupt occurred */
/* LFSS_GEN_EVENT_RIS[TIO15] Bits */
#define LFSS_GEN_EVENT_RIS_TIO15_OFS             (23)                            /* !< TIO15 Offset */
#define LFSS_GEN_EVENT_RIS_TIO15_MASK            ((uint32_t)0x00800000U)         /* !< Tamper I/O 15 event */
#define LFSS_GEN_EVENT_RIS_TIO15_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define LFSS_GEN_EVENT_RIS_TIO15_SET             ((uint32_t)0x00800000U)         /* !< Interrupt occurred */

